app/controllers/comments_controller.rb

INSERT INTO `comments` (`text`, `user_id`, `prototype_id`, `created_at`, `updated_at`) VALUES ('かわいい', 3, 9, '2021-04-16 11:45:44.248672', '2021-04-16 11:45:44.248672')
---
  def create
    @comment = Comment.create(comment_params)