app/controllers/prototypes_controller.rb

SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 8
---
  def show
    @prototype = Prototype.find(params[:id])
    @comment = Comment.new
    @comments = @prototype.comments.includes(:user)