app/controllers/prototypes_controller.rb

INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('猫', '猫', '猫', 3, '2021-04-15 08:10:40.264535', '2021-04-15 08:10:40.264535')
UPDATE `prototypes` SET `prototypes`.`updated_at` = '2021-04-15 08:10:40.278169' WHERE `prototypes`.`id` = 3
---
  def create
    @prototype = Prototype.create(prototype_params)
    if @prototype.save

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 4
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1
---
  def show
    @prototype = Prototype.find(params[:id])
    @comment = Comment.new
    @comments = @prototype.comments.includes(:user)

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 7 LIMIT 1
UPDATE `prototypes` SET `prototypes`.`updated_at` = '2021-04-16 10:19:00.551362' WHERE `prototypes`.`id` = 7
---
  def update
    @prototype = Prototype.find(params[:id])
    if @prototype.update(prototype_params)

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 8 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 8
---
  def destroy
    @prototype = Prototype.find(params[:id])
    @prototype.destroy